"There was an error in processing the images." = "Si è verificato un errore durante l'elaborazione delle immagini.";

"The MakePDF application not found on this system." = "L'applicazione MakePDF non è stata trovata su questo sistema.";